{"Entries":[{"version":"0.0.6.1","filename":"SignWriter Studio 0.0.6.1.exe","date":"January 6, 2012","changes":"Remove DN4 for automatic .net framework installation in program\r\nRemove Eqatec remote error logging Program\r\nHelp About will not displaying in program\r\nCannot double click on file to open in program\r\nDictionary throws error first time it is opened after being installed.\r\nDisplayed dictionary entries remain on screen even after opening a new dictionary file.\r\nError is thrown when cursor is not in Gloss Search and Enter is pressed in dictionary\r\nWhen signs are loaded from file they show a pink square above them in Document.\r\nPictures are not saving to file Cannot open SignEditor from sign loaded from file in Document.\r\nSigns edited in Editor do not show changes in document in Document\r\nGloss to sign throws errors when opened in Document\r\nSettings, throws error when opened in Document\r\nDocument save, can no longer open the file. in Document\r\nSeems to corrupt it or not save the signs to the file in Document.\r\nWhen changing property of sign, sign displays double in Document\r\nShortcut keys and F keys not working in Document\r\nHelp will not show in Document\r\nSaving back to dictionary is not working\r\nWhen all signs are deleted froma document, the shortcut keys no longer work in Document\r\nCannot drag and drop to move the signs around in Document\r\nSymbols added from the favorites cannot be undone in Sign Editor.\r\nRight clicking on Favorites symbols adds it to the sign in Sign Editor.\r\nFirst result in symbol search is already selected, but cannot be further defined in choosers unless another hand shape is chosen first in Sign Editor.\r\nNo way to right-click menu for deleting or adding sequence symbols in Sign Editor.\r\nTrunk symbols are highlighting red when selected in Sign Editor"},{"version":"0.0.6.2","filename":"SignWriter Studio 0.0.6.2.exe","date":"April 17, 2012","changes":"Display program version from the Help/About menu.\r\nHide main menu when Dictionary or Document windows are open in program.\r\nTral days display  from the Help/About menu in program.\r\nLicense can be applied for continual use in program.\r\nRemoved features that are incomplete from the user interface in program.\r\nAdded space around signs so they can be read better in Dictionary.\r\nAdded a search button in Dictionary\r\nAdded a show all button in Dictionary\r\nDisplay what sign language is active in Dictionary.\r\nWhen creating a new Dictionary file, user no longer gets message to create a new file in Dictionary.\r\nImport and Export enabled in Dictionary\r\nImproved speed of importing in Dictionary\r\nImport saves SignPuddle Ids in Dictionary\r\nCan now import and export punctuation in Dictionary\r\nAll signs in SPFML are now being saved to Dictionary.\r\nSPFML text entries are saved to Dictionary for when they are re-exported.\r\nEscape special XML characters when exporting in Dictionary.\r\nLeave bounding box blank when exporting in Dictionary.\r\nDisplay message about languages about to be imported into in Dictionary.\r\nMessage about opening a dictionary to clearer and more specific in Dictionary.\r\nAdded message that document format may not be stable. Format may yet be changed in Document.\r\nSign to Gloss is now working in Document\r\nDefault to not showing glosses when creating a new document\r\nNo longer crashes when add a sign without any symbols from Dictionary in Document\r\nChange popup menu item from \"Beggining of column\" to \"Force to beggining of column\" in Document.\r\nAdded more default favorite symbols in Sign Editor\r\nWhen adding symbols to sign, they are no longer added automatically to the sequence list in Sign Editor.\r\nOverlaping symbols can be seperated from the pop-up menu in Sign Editor.\r\nUndo/Redo is purged when a sign is accepted or canceled in Sign Editor.\r\nAdded a button to Add or Replace a symbol.  Replace works when a symbols is selected otherwise the symbol is added to the sign in Sign Editor.\r\nWhen no symbols are selected, the pop-up menu items apply to all symbols in Sign Editor.\r\nNaming of principal and secondary symbol colors in pop-up menu has been changed in Sign Editor.\r\nEditor defaults to writing signs black on white.\r\nSigns can be colorized in Sign Editor.\r\nChanged size of signbox canvas to 500 by 500 pixels in Sign Editor.\r\nBackground sign color can be changed in Sign Editor.\r\nSymbols can no longer be moved past the edge of the signbox canvas in Sign Editor."},{"version":"0.0.6.3","filename":"SignWriter Studio 0.0.6.3.exe","date":"June 27, 2012","changes":"Fixed a symbol cache bug. Symbols weren't showing when the cache file was corrupted in Dictionary.\r\nChanged the private check box to \"Do Not Export\" and moved it to the end of the grid in Dictionary.\r\nAdded a button to edit the sign for people who don't think of double clicking it in Dictionary.\r\nDictionary Gloss is made bold in Dictionary.\r\nGlosses column in Dictionary changed to \"Other Glosses\" in Dictionary\r\nPhoto column changed to \"Illustration\" in Dictionary\r\nHide the document  buttons in Document\r\nHeads showing properly in Sign Editor\r\nCan now flip the Z arrow in Sign Editor.\r\nSignbox is now limited to only one punctuation in Sign Editor."},{"version":"0.0.6.4","filename":"SignWriter Studio 0.0.6.4.exe","date":"July 12, 2012","changes":"Import and Export properly to PersonalPuddle in Dictionary"},{"version":"0.0.6.5","filename":"SignWriter Studio 0.0.6.5.exe","date":"July 17, 2012","changes":"Improved import time in Dictionary.\r\nCenter signs on head symbols and on trunk symbols in Dictionary."},{"version":"0.0.6.6","filename":"SignWriter Studio 0.0.6.6.exe","date":"July 18, 2012","changes":"Exporting to SignPuddle adds text to identify the puddle in PersonalPuddle in Dictionary.\r\nDetect which signs already exist in a Dictionary and prompts to update them if the sign being imported is different from the one on hand in Dictionary."},{"version":"0.0.6.7","filename":"SignWriter Studio 0.0.6.7.exe","date":"August 28, 2012","changes":"Program now uses proper icons for each file type.\r\nChanged program icon\r\nUpdated the help files for the Copy, Paste and Importing and Exporting in Dictionary.\r\nCopy and Paste FSW codes to and from SignPuddle online in Dictionary.\r\nChanged the Copy and Paste menu in Dictionary.\r\nNow saves signs back to the database faster in Dictionary.\r\nDocument is disabled until the major bugs are fixed in Document\r\nMade the active areas more visible in Sign Editor\r\nFixed some UI issues for keyboarding in Sign Editor\r\nAdded Help to SignEditor\r\nPressing F1 in each area of the will bring up contextualized help in Sign Editor.\r\nAdded Hover over keystroke tips in Sign Editor.\r\nUpdated Help files in Sign Editor."},{"version":"0.0.6.8","filename":"SignWriter Studio 0.0.6.8.exe","date":"October 1, 2012","changes":"Fixed error when opening program in computer with certain operating systems."},{"version":"1.0.0.0","filename":"SignWriter Studio 1.0.0.0.exe","date":"October 28, 2012","changes":"Released program as freeware and version 1.0\r\nSome changes to error loging in program.\r\nDocument is disabled until the major bugs are fixed ."},{"version":"1.1.0.0","filename":"SignWriter Studio 1.1.0.0.exe","date":"June 30, 2013","changes":"Document is added back to the program in Document\r\nSign layout is improved in Document\r\nCan Import and Export FSW in Document\r\nWhen adding a left hand to a sign, shows as left hand in the symbol chooser in Sign Editor."},{"version":"1.2.0.0","filename":"SignWriter Studio 1.2.0.0.exe","date":"August 29, 2013","changes":"SignSearch by symbol in Dictionary\r\nSpecialized search by symbol for heel handshapes in Dictionary"},{"version":"1.2.1.0","filename":"SignWriter Studio 1.2.1.0.exe","date":"March 28, 2014","changes":"Export Dictionary to Anki in Dictionary\r\nExport Dictionary to Html file in Dictionary"},{"version":"1.2.2.0","filename":"SignWriter Studio 1.2.2.0.exe","date":"May 15, 2014","changes":"Delete all selected rows when deleting entries in Dictionary\r\nWhen no result found, get the \"There are no matches for your criteria\" when pressing the Enter key also in Dictionary.\r\nWhen creating new SignWriter Studio files, upgrade file to latest version without asking in Dictionary.\r\nFixed SignSearch was because it would crash in Dictionary\r\nFixed Bilingual mode because it would crash in Dictionary\r\nRemoved substring checkbox for search. Always search by matching any part of the gloss or glosses in Dictionary\r\nExport to HTML with images embeded/optionally save the pngs externally  in Dictionary\r\nSymbol size in size wasn't reading and writing back from the database properly in Dictionary\r\nWhen deleting signs, they are now fully deleted in Dictionary\r\nCopy FSW in Dictionary\r\nSelecting a single symbol shows the group position in the \"All\" symbols section in Dictionary\r\nChange menu text from \"Paste from FSW SignPuddle\" to \"Paste from FSW\" in Dictionary\r\nCheck clipboard before trying to paste non FSW text as FSW in Dictionary\r\nDocument got marked as modified when resizing the window, fixed in Document   \r\nDragging and drop signs to move them arround wasn't working, fixed in Document\r\nWhen scrolled over, the layout wasn't working properly in Document\r\nWhen Pasting a Sign should go below where you clicked in Document\r\nIn Gloss to Sign mark by color which word found exact matches, which were gloss or glosses that contained the search work and which didn't come up with any results in Document\r\nIn Gloss To Sign select all the first result by default in Document.\r\nWhen going to Document, open the last file opened in Document\r\nGloss to Sign, when changing a gloss and leaving an empty do not show any signs. Was showing all signs in the Dictionary\r\nGloss to Sign. Change gloss. Prompt with the previous gloss value  in Document\r\nDocument adding sign from Dictionary no longer adds a blank sign if canceled in Document.\r\nFixed Sign Copy and Paste in Sign Editor  \r\nChange \"Add\" button to \"New\". Make another button \"Add\" to add the favorite to the sign in Sign Editor.\r\nRemove drop down in favorites in Sign Editor.\r\nFavorites of only one symbol positioned in the top left hand corner can be dragged from the Favorites list to any part of the sign in Sign Editor."},{"version":"1.2.3.1","filename":"SignWriter Studio 1.2.3.1.exe","date":"November 11, 2014","changes":"Added more options to export to HTML in Dictionary\r\nExport SignSpelling to HTML in Dictionary\r\nSigns Sorted by SignSpelling Sequence in Dictionary\r\nAnki and HTML export let the user know when they finish exporting in Dictionary.\r\nSuggest Sign Spelling in Sign Editor\r\nMoved Sign Spelling Sequence are beside to be more visible in Sign Editor\r\nMoved the baby edge palm facing to the first of the palm facings in Sign Editor"},{"version":"1.2.4.0","filename":"SignWriter Studio 1.2.4.0.exe","date":"January 29, 2015","changes":"Added a \"Copy as Image\" to the SignWriter Studio document to paste into other programs.\r\nHTML export, entries can be sorted alphabetically if desired."},{"version":"1.2.5.0","filename":"SignWriter Studio 1.2.5.0.exe","date":"May 5, 2016","changes":"Adjusted the color of the Gloss to Sign background.\r\nList not found glosses in Gloss to Sign so as to know which signs will need to be created.\r\nFix Dictionary so that Ctrl-C Ctrl-V can be used to copy and paste text in the text fields\r\nFixed the following bugs in the Gloss to Sign\r\nFixed scrollbar bug in text box in the Gloss to Sign\r\nWhen searching for matches skip blank in the Gloss to Sign\r\nIn gloss not found text box only show unique values in the Gloss to Sign\r\nAdded a tags column to the Dictionary form.\r\nFixed an error which happened when pasting text into the Document which aren´t SignWriterStudio Signs\r\nReporting feature to print dictionaries.\r\nAdded paging to the Dictionary datagrid.\r\nCan now filter dictionary entries by tags.\r\nFixed a bug with the sorting of the dictionary as accented characters where ending up at the bottom of the document. \r\nCentering the images in the reports\r\nWrote code to save entries back to SignPuddle.  \r\nFixed bug that happened when adding new entry\r\nChanged Anki and HTML export to be filtered by the new tags\r\nCan change the column headings and title in the report to PDF.\r\nCreated another report with just the gloss and the SignWriting\r\nSignWriter Studio can to log into SignPuddle so that we can save signs to the puddle. \r\nSend dictionary entries from SignWriter Studio to SignPuddle and to be able to delete entries from SignPuddle.\r\nMade the password box hide the password when signing into SignPuddle from SignWriter Studio\r\nCan send a selection of entries in SignWriterStudio to SignPuddle\r\nSend SignWriterStudio global unique id and Tags to Puddle text field\r\nWhen adding a new sign to SignPuddle get the id back so that further modification can update that sign on SignPuddle\r\nCapability to update an already existing sign on SignPuddle\r\nGloss to Sign can show signs as we type.\r\nGloss to Sign can insert signs before and after selected signs.\r\nGloss to Sign can open the dictionary to create a new entry and add it to the list of signs for the document.\r\nGloss to Sign can switch the sign's lane before it is even added to the document.\r\nGloss to Sign can do wordX3 or any number and I get the same sign over and over again for plurals without having to type out the work that many times."},{"version":"1.2.5.1","filename":"SignWriter Studio 1.2.5.1.exe","date":"May 19, 2016","changes":"Export Fingerspelling feature to create fingerspelling file for SignPuddle\r\nFix bug Inserting sign before another in Gloss to Signs\r\nFix regex bug in SPML import "},{"version":"1.2.5.2","filename":"SignWriter Studio 1.2.5.2.exe","date":"June 29, 2016","changes":"Anki Export now includes an illustration of the sign if present in the dictionary"},{"version":"1.2.5.3","filename":"SignWriter Studio 1.2.5.3.exe","date":"July 28, 2016","changes":"Make signs in Document selectable\r\nMake selected signs in Document Copy and Pastable\r\n"},{"version":"1.2.5.4","filename":"SignWriter Studio 1.2.5.4.exe","date":"September 30, 2016","changes":"Added CEFSharp Chromium browser so that QuickSignEditor can be used in SignEditor\r\nUpdate setup files so that it can deploy CEF\r\nView SignEditor sign in QuickSignEditor\r\nGet modified sign back in SignEditor from QuickSignEditor\r\nGet modified sign back in SignEditor from QuickSignEditor when closing the browser window"},{"version":"1.2.5.6","filename":"SignWriter Studio 1.2.5.6.exe","date":"November 14, 2016","changes":"Added Move symbol to Top Editor\r\nAdded Move symbol to Bottom in Editor\r\nUpdated QuickSignEditor to the latest version"},{"version":"1.2.5.7","filename":"SignWriter Studio 1.2.5.7.exe","date":"December 13, 2016","changes":"GlosstoSign, text trim text for use with tablets without keyboards, because word suggestion adds a trailing space\n\r\nGlosstoSign Move signs up or down.\n\r\nGlosstoSign Select the correct sign by clicking on any part of the row\r\n\nGlosstoSign Display selected sign in sign area automatically\n\r\n\r\nDocument, Save selected signs in document to a new document\r\n\r\nUpdating QuickSignEditor to latest changes"},{"version":"1.2.5.8","filename":"SignWriter Studio 1.2.5.8.exe","date":"December 13, 2016","changes":"Document, can now remove selected signs\r\nDocument, can now drag selected signs\r\nDocument, added popup menu to Cut signs"},{"version":"1.2.5.9","filename":"SignWriter Studio 1.2.5.9.exe","date":"December 19, 2016","changes":"SignEditor:\r\nMake form streachable and add scrollbars\r\nMake split panels sizable\r\nMove Accept and Cancel buttons to top of form\r\nCtrl-number to change areas\r\nReduce width of TreeView margins\r\nFavorites, click to select, double click to add to sign\r\nAllGroups, click to select or expand, double click to add to sign\r\nAllGroups, expand group when groups symbol selected \r\nHandSymbolSearch, reset search settings when initializing\r\nSymbolChooser, split Add Replace button into two seperate buttons\r\nHandChooser, clicking palm facing icon selects radio button\r\nHandChooser, remove drop down for right and left hand and show radio buttons\n\r\nArrowChooser, show each option for fill and remove drop down\r\nArrowChooser, Show first rotation in type selection for arrow selection\r\n\r\nDictionary:\r\nMove accept and cancel button to the left\r\n\r\nDocument:\r\nGlosstoSign, fixed checkbox not being selected when clicking directly on it."},{"version":"1.2.5.10","filename":"SignWriter Studio 1.2.5.10.exe","date":"December 30, 2016","changes":"Display gloss with signs in Document\r\nAdjusted area in SignEditor to better fit 7\" tablet when maximized\r\nUpdated QuickSignEditor to lastest version"},{"version":"1.2.5.11","filename":"SignWriter Studio 1.2.5.11.exe","date":"January 10, 2017","changes":"Document fix bug drag and drop\r\nDocument fix bug opening documents with or without gloss showing\r\nDocument fix bug pasting signs\r\nDocument show and hide gloss showing with signs\r\nDocument enable using searched for gloss as text for signs\r\nSignEditor remove Tab stops on buttons so that arrow keys will work to move symbols"}]}